spec/vcr/Spree_AvalaraTransaction/return_orders/_commit_avatax_final/should_commit_avatax_final.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R873025038","DocDate":"2020-04-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #18 - 4026","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R873025038","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '814'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:45:05 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '560'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "ResultCode": "Success",
        "DocCode": "R873025038",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:45:08.8448654Z",
        "TotalAmount": "10",
        "TotalDiscount": "0",
        "TotalExemption": "0",
        "TotalTaxable": "10",
        "TotalTax": "0.4",
        "TotalTaxCalculated": "0.4",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "Address": "915 S Jackson St",
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ,{
        "Address": "915 S Jackson St",
        "AddressCode": "Orig",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ]
        ,
        "TaxDate": "2020-04-02"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:45:05 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R873025038","DocDate":"2020-04-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #18 - 4026","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R873025038","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1161'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:45:07 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '674'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "DocCode": "R873025038",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:45:01.9242964Z",
        "TotalAmount": "15",
        "TotalDiscount": "0",
        "TotalExemption": "0",
        "TotalTaxable": "15",
        "TotalTax": "0.6",
        "TotalTaxCalculated": "0.6",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ,{
        "LineNo": "1-FR",
        "TaxCode": "FR000000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "5",
        "Rate": "0.040000",
        "Tax": "0.2",
        "TaxCalculated": "0.2",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "5",
        "Rate": "0.040000",
        "Tax": "0.2",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "Address": "915 S Jackson St",
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ,{
        "Address": "1600 Pennsylvania Ave NW",
        "AddressCode": "2",
        "City": "Washington",
        "Country": "US",
        "PostalCode": "20500",
        "Region": "DC",
        "TaxRegionId": "949",
        "JurisCode": "1100000000"}
        ]
        ,
        "TaxDate": "2020-04-02",
        "ResultCode": "Success"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:45:07 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R873025038","DocDate":"2020-04-02","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #18 - 4026","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R873025038","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1162'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:45:09 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '649'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "ResultCode": "Success",
        "DocCode": "R873025038",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:45:05.9357281Z",
        "TotalAmount": "20",
        "TotalDiscount": "0",
        "TotalExemption": "0",
        "TotalTaxable": "20",
        "TotalTax": "0.8",
        "TotalTaxCalculated": "0.8",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ,{
        "LineNo": "1-FR",
        "TaxCode": "FR000000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000",
        "Address": "915 S Jackson St"}
        ,{
        "AddressCode": "2",
        "City": "Washington",
        "Country": "US",
        "PostalCode": "20500",
        "Region": "DC",
        "TaxRegionId": "949",
        "JurisCode": "1100000000",
        "Address": "1600 Pennsylvania Ave NW"}
        ]
        ,
        "TaxDate": "2020-04-02"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:45:09 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R873025038","DocDate":"2020-04-02","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #18 - 4026","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R873025038","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1163'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:45:11 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '654'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "ResultCode": "Success",
        "DocCode": "R873025038",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:45:07.6935932Z",
        "TotalAmount": "20",
        "TotalDiscount": "0",
        "TotalExemption": "0",
        "TotalTaxable": "20",
        "TotalTax": "0.8",
        "TotalTaxCalculated": "0.8",
        "TaxLines": [
        {
        "LineNo": "1-LI",
        "TaxCode": "PC030000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ,{
        "LineNo": "1-FR",
        "TaxCode": "FR000000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "TaxCalculated": "0.4",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "10",
        "Rate": "0.040000",
        "Tax": "0.4",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "Address": "915 S Jackson St",
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ,{
        "Address": "1600 Pennsylvania Ave NW",
        "AddressCode": "2",
        "City": "Washington",
        "Country": "US",
        "PostalCode": "20500",
        "Region": "DC",
        "TaxRegionId": "949",
        "JurisCode": "1100000000"}
        ]
        ,
        "TaxDate": "2020-04-02"}
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:45:11 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R873025038","DocDate":"2020-04-02","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #18 - 4026","TaxCode":"PC030000","ItemCode":"SKU-20","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R873025038","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1163'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 500
      message: Internal Server Error
    headers:
      Date:
      - Thu, 02 Apr 2020 19:45:12 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '223'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
        "ResultCode": "Error",
        "Messages": [
        {
        "Summary": "DocStatus is invalid for this operation.",
        "Details": "Expected Saved|Posted",
        "RefersTo": "DocStatus",
        "Severity": "Error",
        "Source": "Avalara.AvaTax.Services.Tax"}
        ]
        }
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:45:12 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R873025038.","DocDate":"2020-04-02","Commit":true,"DocType":"ReturnOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","PostalCode":"36104","Country":"United
        States"},{"AddressCode":"Dest","Line1":"915 S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"-RA","ItemCode":"fake-refund-transaction-3","Qty":1,"Amount":-20.8,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Refund","TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R873025038","DetailLevel":"Tax","CurrencyCode":"USD","TaxOverride":{"TaxOverrideType":"TaxDate","Reason":"Refund
        for return #3","TaxDate":"2020-04-02"}}'
    headers:
      Accept:
      - "*/*"
      User-Agent:
      - rest-client/2.1.0 (darwin18.7.0 x86_64) ruby/2.5.0p0
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '987'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Apr 2020 19:45:13 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '555'
      Connection:
      - keep-alive
      Server:
      - Microsoft-IIS/8.5
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains
    body:
      encoding: ASCII-8BIT
      string: |
        {
        "ResultCode": "Success",
        "DocDate": "2020-04-02",
        "Timestamp": "2020-04-02T19:45:14.1687853Z",
        "TotalAmount": "-20",
        "TotalDiscount": "0",
        "TotalExemption": "0",
        "TotalTaxable": "-20",
        "TotalTax": "-0.8",
        "TotalTaxCalculated": "-0.8",
        "TaxDate": "2020-04-02",
        "DocCode": "R873025038.",
        "TaxLines": [
        {
        "LineNo": "-RA",
        "TaxCode": "P0000000",
        "Taxability": "true",
        "BoundaryLevel": "Address",
        "Exemption": "0",
        "Discount": "0",
        "Taxable": "-20",
        "Rate": "0.040000",
        "Tax": "-0.8",
        "TaxCalculated": "-0.8",
        "TaxDetails": [
        {
        "Country": "US",
        "Region": "AL",
        "JurisType": "State",
        "JurisCode": "01",
        "Taxable": "-20",
        "Rate": "0.040000",
        "Tax": "-0.8",
        "JurisName": "ALABAMA",
        "TaxName": "AL STATE TAX"}
        ]
        }
        ]
        ,
        "TaxAddresses": [
        {
        "Address": "915 S Jackson St",
        "AddressCode": "Dest",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ,{
        "Address": "915 S Jackson St",
        "AddressCode": "Orig",
        "City": "Montgomery",
        "Country": "US",
        "PostalCode": "36104",
        "Region": "AL",
        "TaxRegionId": "2052799",
        "JurisCode": "0110151000"}
        ]
        }
    http_version: null
  recorded_at: Thu, 02 Apr 2020 19:45:13 GMT
recorded_with: VCR 5.1.0
